Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The following very basic and somewhat casually defined presentation syntax will be used.
zh_cn: 将使用以下非常基本的、有点随意定义的表示语法。

source: The format for such a body is not defined by this specification, but might be defined by future extensions to HTTP.
zh_cn: 此规范未定义此类主体的格式，但可能由未来的 HTTP 扩展定义。

source: The four options for Request-URI are dependent on the nature of the request.
zh_cn: Request-URI 的四个选项取决于请求的性质。

source: The fragment identifier component of a URI allows indirect identification of a secondary resource by reference to a primary resource and additional identifying information.
zh_cn: URI 的片段标识符组件允许通过引用主要资源和附加标识信息来间接标识辅助资源。

source: The fragment's format and resolution is therefore dependent on the media type [RFC2046] of a potentially retrieved representation, even though such a retrieval is only performed if the URI is dereferenced.
zh_cn: 因此，片段的格式和解析取决于可能检索的表示的媒体类型 [RFC2046]，即使仅在取消引用 URI 时也执行此类检索。

source: The full form is "<n>#<m>element" indicating at least <n> and at most <m> elements, each separated by one or more commas (",") and OPTIONAL linear white space (LWS).
zh_cn: 完整形式是“<n>#<m>element”，表示最少 <n> 和最多 <m> 个元素，每个元素由一个或多个逗号(“,”)和可选线性白色空间(LWS)分隔。

source: The full form is "<n>*<m>element" indicating at least <n> and at most
zh_cn: 完整形式是“<n>*<m>element”，表示至少 <n> 和至多

source: The fundamental difference between the POST and PUT requests is reflected in the different meaning of the Request-URI.
zh_cn: POST 和 PUT 请求之间的根本区别体现在 Request-URI 的不同含义上。

source: The fundamental rule is that higher levels must be cognizant of what their security requirements are and never transmit information over a channel less secure than what they require.
zh_cn: 基本规则是，更高级别必须认识到其安全要求是什么，并且永远不会通过比其需要的安全性更低的信道传输信息。

source: The general pattern for adding a new secret is to use HKDF-Extract with the Salt being the current secret state and the Input Keying Material (IKM) being the new secret to be added.
zh_cn: 添加新机密的一般模式是使用 HKDF-Extract，其中 Salt 是当前的秘钥状态，输入密钥材料(IKM)是要添加的新机密。

source: The general pattern here is that the secrets shown down the left side of the diagram are just raw entropy without context, whereas the secrets down the right side include Handshake Context and therefore can be used to derive working keys without additional context.
zh_cn: 这里的一般模式是图左侧显示的机密只是没有上下文的原始熵，而右侧的机密包括握手上下文，因此可以用来派生工作密钥而无需额外的上下文。

source: The generator is bound to a (possibly fictitious) 32 bit clock whose low order bit is incremented roughly every 4 microseconds.
zh_cn: 生成器绑定到(可能是虚构的)32 位时钟，其低位比特大约每 4 微秒递增一次。

source: The generator used for the Diffie-Hellman operation.
zh_cn: 用于 Diffie-Hellman 操作的生成器。

source: The generic URI syntax consists of a hierarchical sequence of components referred to as the scheme, authority, path, query, and fragment.
zh_cn: 通用 URI 语法由分层的组件序列组成，称为方案(scheme)，权限(authority)，路径(path)，查询(query)和片段(fragment)。

source: The generic syntax provides a common means for distinguishing an authority based on a registered name or server address, along with optional port and user information.
zh_cn: 通用语法提供了用于基于注册名称或服务器地址，以及可选的端口和用户信息来区分权限的常用手段。

source: The generic syntax uses the slash ("/"), question mark ("?"), and number sign ("#") characters to delimit components that are significant to the generic parser's hierarchical interpretation of an identifier.
zh_cn: 通用语法使用斜杠(“/”)，问号(“?”)和数字符号(“#”)来划分对于通用解析器的标识符层次解释很重要的组件。

source: The goal of HTTP/1.1 is to support the wide diversity of configurations already deployed while introducing protocol constructs that meet the needs of those who build web applications that require high reliability and, failing that, at least reliable indications of failure.
zh_cn: HTTP/1.1 的目标是支持已经部署的各种配置，同时引入协议构造，以满足那些构建需要高可靠性的 Web 应用程序的需求，并且失败，至少可靠的失败指示。

source: The goals of the TLS protocol, in order of priority, are as follows:
zh_cn: TLS 协议的目标按优先顺序排列如下：

source: The good news is that operator names remain (mostly) the same.
zh_cn: 好消息是操作符名称(大多数)保持不变。

source: The grammar described by this specification is word-based.
zh_cn: 本说明书描述的语法是基于单词的。

source: The handshake can be thought of as having three phases (indicated in the diagram above):
zh_cn: 握手可以被认为有三个阶段(如上图所示)：

source: The handshake protocol allows peers to negotiate a protocol version, select cryptographic algorithms, optionally authenticate each other, and establish shared secret keying material.
zh_cn: 握手协议允许对等端协商协议版本，选择加密算法，可选地相互认证，以及建立共享秘密密钥材料。

source: The handshake protocol is designed to resist tampering; an active attacker should not be able to force the peers to negotiate different parameters than they would if the connection were not under attack.
zh_cn: 握手协议旨在抵制篡改；如果连接没有受到攻击，主动攻击者应该不能够强制对等方协商不同的参数。

source: The handshake protocol is used to negotiate the security parameters of a connection.
zh_cn: 握手协议用于协商连接的安全参数。

source: The handshake protocol messages are presented below in the order they MUST be sent; sending handshake messages in an unexpected order results in a fatal error.
zh_cn: 握手协议消息按照它们必须发送的顺序显示在下面；以意外顺序发送握手消息会导致致命错误。

source: The hash and signature algorithms used in the signature MUST be one of those present in the supported_signature_algorithms field of the CertificateRequest message.
zh_cn: 在签名中所使用的散列和签名算法必须是那些存在于 CertificateRequest 消息的 supported_signature_algorithms 字段中的一个。

source: The hello phase messages are used to exchange security enhancement capabilities between the client and server.
zh_cn: hello 阶段消息用于在客户端和服务器之间交换安全增强功能。

source: The heuristics noted above will change over time, particularly when a new URI scheme becomes popular, and are often incorrect when used out of context.
zh_cn: 上面提到的启发式方法将随着时间的推移而改变，特别是当新的 URI 方案变得流行时，并且当在上下文之外使用时通常是不正确的。

source: The hierarchical path component and optional query component serve as an identifier for a potential target resource within that origin server's name space.
zh_cn: 层次的 path 组件和可选的 query 组件用作该源服务器的名称空间内的潜在目标资源的标识符。

source: The higher-level protocol used to process the enclosed fragment.
zh_cn: 用于处理封闭片段的更高级协议。

source: The host subcomponent is case-insensitive.
zh_cn: 主机子组件不区分大小写。

source: The host subcomponent of authority is identified by an IP literal encapsulated within square brackets, an IPv4 address in dotted-decimal form, or a registered name.
zh_cn: 权限的主机子组件由封装在方括号内的 IP 文字，点分十进制形式的 IPv4 地址或注册名称标识。

source: The identified secondary resource may be some portion or subset of the primary resource, some view on representations of the primary resource, or some other resource defined or described by those representations.
zh_cn: 所标识的辅助资源可以是主要资源的一些部分或子集，关于主要资源的表示的一些视图，或者由那些表示定义或描述的一些其他资源。

source: The identifier octets shall encode the ASN.1 tag (class and number) of the type of the data value.
zh_cn: 标识符八位字节应编码数据值类型的 ASN.1 标记(类和编号)。

source: The implementation diversity of HTTP means that not all user agents can make interactive suggestions to their user or provide adequate warning for security or privacy concerns.
zh_cn: HTTP 的实现多样性意味着并非所有用户代理都可以向其用户提供交互式建议，或者为安全性或隐私问题提供足够的警告。

source: The important distinction here is that the user did not request the side-effects, so therefore cannot be held accountable for them.
zh_cn: 这里的重要区别是，用户没有要求副作用，因此不能追究他们的责任。

source: The individual values of the numeric status codes defined for HTTP/1.1, and an example set of corresponding Reason-Phrase's, are presented below.
zh_cn: 为 HTTP/1.1 定义的数字状态代码的各个值以及相应的 Reason-Phrase 的示例集如下所示。

source: The information transferred as the payload of a request or response.
zh_cn: 作为请求或响应的有效载荷传输的信息。

source: The initial 64-byte pad clears that prefix along with the server-controlled ServerHello.random.
zh_cn: 最初的 64 字节填充将清除该前缀以及服务器控制的 ServerHello.random。

source: The initial current state always specifies that no encryption, compression, or MAC will be used.
zh_cn: 初始当前状态始终指定不使用加密，压缩或 MAC。

source: The initial octet shall be encoded as follows:
zh_cn: 初始八位字节应编码如下：

source: The initial send sequence number (ISS) is chosen by the data sending TCP, and the initial receive sequence number (IRS) is learned during the connection establishing procedure.
zh_cn: 初始发送序列号(ISS)由数据发送 TCP 选择，并且在连接建立过程期间学习初始接收序列号(IRS)。

source: The initial sequence number chosen is
zh_cn: 选择的初始序列号是

source: The initial set of extensions is defined in a companion document [TLSEXT].
zh_cn: 初始扩展集在伴随文档 [TLSEXT] 中定义。

source: The input may be of any length, and aead-ciphered output is generally larger than the input in order to accommodate the integrity check value.
zh_cn: 输入可以是任何长度，并且加密输出通常大于输入，以便适应完整性检查值。

source: The intention of HTTP's versioning design is that the major number will only be incremented if an incompatible message syntax is introduced, and that the minor number will only be incremented when changes made to the protocol have the effect of adding to the message semantics or implying additional capabilities of the sender.
zh_cn: HTTP 的版本控制设计的目的是，只有在引入不兼容的消息语法时才会增加主要编号，并且只有当对协议进行的更改具有添加到消息语义或暗示附加的发送者的能力时，次要编号才会增加。

source: The interaction of the certificate_types and supported_signature_algorithms fields is somewhat complicated.
zh_cn: certificate_types 和 supported_signature_algorithms 字段的交互有点复杂。

source: The interpretation of a header field does not change between minor versions of the same major HTTP version, though the default behavior of a recipient in the absence of such a field can change.
zh_cn: 首部字段的解释在相同主要 HTTP 版本的次要版本之间不会改变，但是在没有这样的字段的情况下接收者的默认行为可以改变。

source: The key derivation process incorporates both the input secrets and the handshake transcript.
zh_cn: 密钥派生过程包含输入密钥和握手 transcript。

source: The key derivation process makes use of the HKDF-Extract and HKDF-Expand functions as defined for HKDF [RFC5869], as well as the functions defined below:
zh_cn: 密钥派生过程使用 HKDF [RFC5869] 定义的 HKDF-Extract 和 HKDF-Expand 函数，以及下面定义的函数：

source: The key exchange messages are used to determine the security capabilities of the client and the server and to establish shared secrets, including the traffic keys used to protect the rest of the handshake and the data.
zh_cn: 密钥交换消息用于确定客户端和服务器的安全性能并建立共享机密，包括用于保护其余部分的握手和数据的通信密钥。

source: The key is either the client_write_key or the server_write_key, the nonce is derived from the sequence number and the client_write_iv or server_write_iv (see Section 5.3), and the additional data input is the record header.
zh_cn: 密钥是 client_write_key 或 server_write_key，nonce 是从序列号和 client_write_iv 或 server_write_iv 派生的(参见第 5.3 节)，附加数据输入是记录首部。

source: The key is either the client_write_key or the server_write_key.
zh_cn: 密钥是 client_write_key 或 server_write_key。

source: The key used to compute the Finished message is computed from the Base Key defined in Section 4.4 using HKDF (see Section 7.1).
zh_cn: 用于计算 Finished 消息的密钥是使用 HKDF 从第 4.4 节中定义的 Base Key 计算的(参见第 7.1 节)。

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in RFC 2119.
zh_cn: 本文件中的关键词 "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", 和 "OPTIONAL" 按照 RFC 2119 中的描述进行解释。

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in RFC 2119 [REQ].
zh_cn: 本文件中的关键词 "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", 和 "OPTIONAL" 按照 RFC 2119 [REQ] 中的描述进行解释。

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in [RFC2119].
zh_cn: 本文件中的关键词 "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", 和 "OPTIONAL" 按照 [RFC2119] 中的描述进行解释。

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.
zh_cn: 在本文档中关键字 "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", 和 "OPTIONAL" 应按照 BCP 14 [RFC2119] [RFC8174] 中所述解释，当且仅当它们出现为全部是大写字母时。

source: The key_exchange values for each KeyShareEntry MUST be generated independently.
zh_cn: 每个 KeyShareEntry 的 key_exchange 值必须独立生成。

source: The keys for this symmetric encryption are generated uniquely for each connection and are based on a secret negotiated by another protocol (such as the TLS Handshake Protocol).
zh_cn: 这种对称加密的密钥是为每个连接唯一生成的，并且基于另一个协议(例如 TLS 握手协议)协商的密钥。

source: The keys found in certificates MUST also be of appropriate type for the signature algorithms they are used with.
zh_cn: 证书中的密钥也必须是与它们一起使用的签名算法的适当类型。

source: The label is an ASCII string.
zh_cn: label 是 ASCII 字符串。

source: The labels in this specification have all been chosen to fit within this limit.
zh_cn: 所有标准都已选择符合此限制。

source: The labels specified in this document are all ASCII strings and do not include a trailing NUL byte.
zh_cn: 本文档中指定的标签都是 ASCII 字符串，不包括尾随 NUL 字节。

source: The last 8 bytes MUST be overwritten as described below if negotiating TLS 1.2 or TLS 1.1, but the remaining bytes MUST be random.
zh_cn: 如果协商 TLS 1.2 或 TLS 1.1，则必须覆盖最后 8 个字节，如下所述，但其余字节必须是随机的。

source: The last two digits do not have any categorization role.
zh_cn: 最后两位数字没有任何分类角色。

source: The latest (newest) version supported by the client.
zh_cn: 客户支持的最新(最新)版本。

source: The latter is expressed by sending the "certificate_authorities" extension (see Section 4.2.4).
zh_cn: 后者通过发送“certificate_authorities”扩展来表示(参见第 4.2.4 节)。

source: The latter technique can exacerbate network congestion.
zh_cn: 后一种技术可能会加剧网络拥塞。

source: The leading octet shall be encoded as follows:
zh_cn: 前导八位组的编码如下：

source: The length (in bytes) of the following TLSCiphertext.fragment.
zh_cn: 后续 TLSCiphertext.fragment 的长度(以字节为单位)。

source: The length (in bytes) of the following TLSCompressed.fragment.
zh_cn: 后续 TLSCompressed.fragment 的长度(以字节为单位)。

source: The length (in bytes) of the following TLSPlaintext.fragment.
zh_cn: 后续 TLSPlaintext.fragment 的长度(以字节为单位)。

source: The length MUST NOT exceed 2^14 + 1024.
zh_cn: 长度不得超过 2 ^ 14 + 1024。

source: The length MUST NOT exceed 2^14 + 2048.
zh_cn: 长度不得超过 2^14 + 2048。

source: The length MUST NOT exceed 2^14 + 256 bytes.
zh_cn: 长度不得超过 2 ^ 14 + 256 字节。

source: The length MUST NOT exceed 2^14 bytes.
zh_cn: 长度不得超过 2 ^ 14 字节。

source: The length MUST NOT exceed 2^14.
zh_cn: 长度不得超过 2^14。

source: The length of a message body is determined by one of the following (in order of precedence):
zh_cn: 消息主体的长度由以下之一确定(按优先顺序排列)：

source: The length of an encoded vector must be an even multiple of the length of a single element (for example, a 17-byte vector of uint16 would be illegal).
zh_cn: 编码 vector 的长度必须是单个元素长度的偶数倍(例如，uint16 的 17 字节矢量将是非法的)。

source: The length of an encoded vector must be an exact multiple of the length of a single element (e.g., a 17-byte vector of uint16 would be illegal).
zh_cn: 编码 vector 的长度必须是单个元素长度的精确倍数(例如，uint16 的 17 字节 vector 将是非法的)。

source: The length of the AEAD output will generally be larger than the plaintext, but by an amount that varies with the AEAD algorithm.
zh_cn: AEAD 输出的长度通常大于明文，但是随着 AEAD 算法的变化而变化。

source: The length of the Salt MUST be equal to the length of the digest algorithm.
zh_cn: Salt 的长度必须等于摘要算法的长度。

source: The length of the Salt MUST be equal to the length of the output of the digest algorithm.
zh_cn: Salt 的长度必须等于摘要算法的输出长度。

source: The length of the plaintext is greater than the corresponding TLSPlaintext.length due to the inclusion of TLSInnerPlaintext.type and any padding supplied by the sender.
zh_cn: 由于包含 TLSInnerPlaintext.type 和发送方提供的任何填充，明文的长度大于相应的 TLSPlaintext.length。

source: The length of the premaster secret will vary depending on key exchange method.
zh_cn: 预主密钥的长度将取决于密钥交换方法有所不同。

source: The length of the signature is known because the algorithm and key used for the signing are known prior to encoding or decoding this structure.
zh_cn: 签名的长度是已知的，因为在编码或解码该结构之前已知用于签名的算法和密钥。

source: The length of the signature is specified by the signing algorithm and key.
zh_cn: 签名的长度由签名算法和密钥指定。

source: The length of this structure, in bytes, would be equal to two bytes for field1 and field2, plus two bytes for the signature and hash algorithm, plus two bytes for the length of the signature, plus the length of the output of the signing algorithm.
zh_cn: 此结构的长度(以字节为单位)将等于 field1 和 field2 的两个字节，加上签名和散列算法的两个字节，加上签名长度的两个字节，加上签名算法的输出长度。

source: The length of time between the generation of a response and its expiration time.
zh_cn: 生成响应与其到期时间之间的时间长度。

source: The length will be in the form of a number consuming as many bytes as required to hold the vector's specified maximum (ceiling) length.
zh_cn: 长度将采用数字的形式，消耗尽可能多的字节数来保存 vector 指定的最大(ceiling)长度。

source: The length will generally be larger than TLSCompressed.length, but by an amount that varies with the AEAD cipher.
zh_cn: 长度通常大于 TLSCompressed.length，但随着 AEAD 加密的变化而变化。

source: The limit of two connections per server has been removed.
zh_cn: 已删除每个服务器的两个连接的限制。

source: The list of current Internet-Drafts is at https://datatracker.ietf.org/drafts/current/.
zh_cn: 当前的互联网草案列表位于 https://datatracker.ietf.org/drafts/current/。

source: The list of extension types is maintained by IANA as described in Section 11.
zh_cn: 扩展类型列表由 IANA 维护，如第 11 节所述。

source: The list of extension types is maintained by IANA as described in Section 12.
zh_cn: 扩展类型列表由 IANA 维护，如第 12 节所述。

source: The list of methods allowed by a resource can be specified in an Allow header field (section 14.7).
zh_cn: 可以在 Allow 首部字段中指定资源允许的方法列表(第 14.7 节)。

source: The main issue with backpressure is that many hot sources, such as UI events, can't be reasonably backpressured and cause unexpected `MissingBackpressureException` (i.e., beginners don't expect them).
zh_cn: 背压的主要问题是许多热源，例如 UI 事件，不能合理地背压并导致意外的 `MissingBackpressureException`(即，初学者不期望它们)。

source: The main purpose is to avoid the tracking overhead of the `Worker`s for typically one-shot tasks.
zh_cn: 主要目的是避免通常一次性任务的 `Worker` 的跟踪开销。

source: The maintenance of a TCP connection requires the remembering of several variables.
zh_cn: 维护 TCP 连接需要记住几个变量。

source: The major changes are:
zh_cn: 主要变化是：

source: The mapping of HTTP request and response structures onto the data units of an underlying transport protocol is outside the scope of this specification.
zh_cn: HTTP 请求和响应结构到底层传输协议的数据单元的映射超出了本规范的范围。

source: The master secret is always exactly 48 bytes in length.
zh_cn: 主密钥的长度总是恰好 48 个字节。

source: The master secret is expanded into a sequence of secure bytes, which is then split to a client write MAC key, a server write MAC key, a client write encryption key, and a server write encryption key.
zh_cn: 主密钥 (master secret) 被扩展为一系列安全字节，然后将其拆分为客户端写入 MAC 密钥，服务器写入 MAC 密钥，客户端写入加密密钥和服务器写入加密密钥。

source: The meaning of the "deflate" content coding has been clarified.
zh_cn: “deflate”内容编码的含义已经阐明。

source: The mechanism by which the variant is selected at runtime is not prescribed by the presentation language.
zh_cn: 在运行时选择变体的机制不是由表示语言规定的。

source: The mechanism for selecting the appropriate representation when servicing a request, as described in section 12.
zh_cn: 在服务请求时选择适当表示的机制，如第 12 节所述。

source: The media type registration process is outlined in RFC 1590 [17].
zh_cn: RFC 1590 [17] 概述了媒体类型注册过程。

source: The message body (if any) of an HTTP message is used to carry the payload body of that request or response.
zh_cn: HTTP 消息的消息体(如果有的话)用于携带该请求或响应的有效载荷主体。

source: The message body is identical to the payload body unless a transfer coding has been applied, as described in Section 3.3.1.
zh_cn: 除非已应用传输编码，否则消息主体与有效载荷主体相同，如第 3.3.1 节所述。

source: The message body is itself a protocol element and MUST therefore use only CRLF to represent line breaks between body-parts.
zh_cn: 消息体本身就是一个协议元素，因此必须只使用 CRLF 来表示正文部分之间的换行符。

source: The message consists of a single byte of value 1.
zh_cn: 该消息由值为 1 的单个字节组成。

source: The message-body (if any) of an HTTP message is used to carry the entity-body associated with the request or response.
zh_cn: HTTP 消息的消息主体(如果有的话)用于携带与请求或响应相关联的实体主体。

source: The message-body differs from the entity-body only when a transfer-coding has been applied, as indicated by the Transfer-Encoding header field (section 14.41).
zh_cn: 只有当应用了传输编码时，消息主体才与实体主体不同，如 Transfer-Encoding 首部字段所示(第 14.41 节)。

source: The messages are treated as transparent data to the record layer.
zh_cn: 消息被视为记录层的透明数据。

source: The metainformation contained in the HTTP headers in response to a HEAD request SHOULD be identical to the information sent in response to a GET request.
zh_cn: 响应 HEAD 请求的 HTTP 首部中包含的元信息应该与响应 GET 请求时发送的信息相同。

source: The method is case-sensitive.
zh_cn: 该方法区分大小写。

source: The method that returns the scheduler's own notion of current time, `now()` has been changed to accept a `TimeUnit` to indicate the unit of measure.
zh_cn: 返回调度器自己的当前时间概念 `now()` 的方法已被更改为接受 `TimeUnit` 来指示度量单位。

source: The method token indicates the request method to be performed on the target resource.
zh_cn: 方法标记指示要对目标资源执行的请求方法。

source: The method token is case-sensitive because it might be used as a gateway to object-based systems with case-sensitive method names.
zh_cn: 方法标记区分大小写，因为它可能用作具有区分大小写方法名称的基于对象的系统的网关。

source: The methods GET and HEAD MUST be supported by all general-purpose servers.
zh_cn: 所有通用服务器都必须支持 GET 和 HEAD 方法。

source: The methods GET, HEAD, PUT and DELETE share this property.
zh_cn: 方法 GET，HEAD，PUT 和 DELETE 共享此属性。

source: The methods have a default implementation that reuses `createWorker` properly but can be overridden with more efficient implementations if necessary.
zh_cn: 这些方法有一个默认实现，可以正确地重用 `createWorker`，但如果需要可以用更高效的实现覆盖。

source: The minor version advertises the sender's communication capabilities even when the sender is only using a backwards-compatible subset of the protocol, thereby letting the recipient know that more advanced features can be used in response (by servers) or in future requests (by clients).
zh_cn: 即使仅使用协议的向后兼容子集，次要版本也会通告发送者的通信功能，从而让接收者知道可以使用更高级的功能(通过服务器)或将来的请求(通过客户端)。

source: The most basic backpressure aware source is created via `just`:
zh_cn: 最基本的背压感知源是通过 `just` 创建的：

source: The most common form of Request-URI is that used to identify a resource on an origin server or gateway.
zh_cn: Request-URI 的最常见形式是用于标识源服务器或网关上的资源。

source: The most common form of request-target is the origin-form.
zh_cn: 最常见的请求目标形式是原始形式。

source: The most common name registry mechanism is the Domain Name System (DNS).
zh_cn: 最常见的名称注册机制是域名系统(DNS)。

source: The most frequent examples of same-document references are relative references that are empty or include only the number sign ("#") separator followed by a fragment identifier.
zh_cn: 相同文档引用的最常见示例是相对引用，它们是空的或仅包含数字符号(“#”)分隔符，后跟片段标识符。

source: The most typical scenario is to given a value, invoke another service, await and continue with its result:
zh_cn: 最典型的情况是给出一个值，调用另一个服务，等待其结果并继续：

source: The name of a rule is simply the name itself (without any enclosing "<" and ">") and is separated from its definition by the equal "=" character.
zh_cn: 规则的名称只是名称本身(没有任何括号“<”和“>”)，并且通过等号“=”字符与其定义分开。

source: The name space of language tags is administered by the IANA.
zh_cn: 语言标签的名称空间由 IANA 管理。

source: The names DH_DSS, DH_RSA, ECDH_ECDSA, and ECDH_RSA are historical.
zh_cn: 名称 DH_DSS，DH_RSA，ECDH_ECDSA 和 ECDH_RSA 是历史名称。

source: The names assigned to enumerateds do not need to be unique.
zh_cn: 分配给枚举的名称不必是唯一的。

source: The names of the elements of an enumeration are scoped within the defined type.
zh_cn: 枚举元素的名称范围在定义的类型内。
